benchmarks/definitive_results/theory/S_default/llama-2-7b/p25_dataset/_0.55_/log_10459351.out
WARNING 10-21 12:45:02 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=54776, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=3000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/theory/S_default/llama-2-7b/p25_dataset/_0.55_', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=54776 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --max-num-seqs=3000 --gpu-memory-utilization=0.55', disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     3000      
Benchmark duration (s):                  11.88     
Total input tokens:                      69000     
Total generated tokens:                  81000     
Request throughput (req/s):              252.58    
Output token throughput (tok/s):         6819.68   
Total Token throughput (tok/s):          12629.04  
---------------Time to First Token----------------
Mean TTFT (ms):                          4676.18   
Median TTFT (ms):                        4707.99   
P99 TTFT (ms):                           9930.02   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          115.64    
Median TPOT (ms):                        107.61    
P99 TPOT (ms):                           185.09    
---------------Inter-token Latency----------------
Mean ITL (ms):                           118.02    
Median ITL (ms):                         56.98     
P99 ITL (ms):                            843.21    
==================================================
Concurrent checker terminated
Server terminated